app/controllers/clients_controller.rb

  def index
      @clients = Client.search(params[:name],
                 params[:identificacion]).page(params[:page]).per_page(3).order('id DESC')
---
SELECT "clients".* FROM "clients" WHERE (upper(name) like '%%') ORDER BY id DESC LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "clients" WHERE (upper(name) like '%%')