app/controllers/garments_controller.rb

SELECT "garments".* FROM "garments" WHERE (upper(name) like '%%') ORDER BY name LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "garments" WHERE (upper(name) like '%%')
---
  def index
      @garments = Garment.search(params[:name]).page(params[:page]).per_page(3).order('name')