app/controllers/inputs_controller.rb

    def index
        @categories = Category.order("id").all
        @inputs = Input.search(params[:name], params[:categoria]).page(params[:page]).per_page(3).order('name')
---
SELECT "categories".* FROM "categories" ORDER BY id
SELECT "inputs".* FROM "inputs" WHERE (upper(name) like '%%') ORDER BY name LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "inputs" WHERE (upper(name) like '%%')