app/controllers/production_orders_controller.rb

    def index
      @production_orders = ProductionOrder.page(params[:page]).per_page(3)
---
SELECT "production_orders".* FROM "production_orders" LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "production_orders"